/*
    创建者：shuxiaokai
    创建时间：2021-01-16 13:57
    模块名称：查询字符串
    备注：xxxx
*/
<template>
    <s-collapse-card title="请求参数(params)">

    </s-collapse-card>
</template>

<script>
export default {
    data() {
        return {

        };
    },
    created() {

    },
    methods: {
        //=====================================获取远程数据==================================//

        //=====================================前后端交互====================================//

        //=====================================组件间交互====================================//  
        
        //=====================================其他操作=====================================//

    }
};
</script>



<style lang="scss">

</style>
