/*
    创建者：shuxiaokai
    创建时间：2021-02-05 21:33
    模块名称：
    备注：
*/
<template>
    <div class="title-value">
        <h2 class="title">{{ title }}</h2>
        <div class="value">
            <slot />
        </div>
    </div>
</template>

<script>
export default {
    props: {
        title: {
            type: [String],
            default() {
                return "";
            },
        },
    },
    data() {
        return {
            //=================================表单与表格参数================================//

            //===================================枚举参数====================================//

            //===================================业务参数====================================//

            //===================================其他参数====================================//
        };
    },
    created() {

    },
    methods: {
        //==================================初始化&获取远端数据===============================//

        //=====================================前后端交互====================================//

        //=====================================组件间交互====================================//

        //=====================================其他操作=====================================//

    },
};
</script>

<style lang="scss">
.title-value {
    margin-bottom: size(10);
    .title {
        margin-top: 0;
        margin-bottom: size(10);
        font-size: fz(16);
        font-weight: normal;
        color: $gray-800;
    }
    .value {
        margin-left: 1.5em;
    }
}
</style>
